export const specialities = [
  {
    code: '01',
    name: 'Освіта',
    specialties: [
      {
        code: '011',
        name: 'Науки про освіту',
      },
      {
        code: '012',
        name: 'Дошкільна освіта',
      },
      {
        code: '013',
        name: 'Початкова освіта',
      },
      {
        code: '014',
        name: 'Середня освіта (за предметними спеціалізаціями)',
      },
      {
        code: '015',
        name: 'Професійна освіта (за спеціалізаціями)',
      },
      {
        code: '016',
        name: 'Спеціальна освіта',
      },
      {
        code: '017',
        name: 'Фізична культура і спорт',
      },
    ],
  },
  {
    code: '02',
    name: 'Культура і мистецтво',
    specialties: [
      {
        code: '021',
        name: 'Аудіовізуальне мистецтво та виробництво',
      },
      {
        code: '022',
        name: 'Дизайн',
      },
      {
        code: '023',
        name: 'Образотворче мистецтво, декоративне мистецтво, реставрація',
      },
      {
        code: '024',
        name: 'Хореографія',
      },
      {
        code: '025',
        name: 'Музичне мистецтво',
      },
      {
        code: '026',
        name: 'Сценічне мистецтво',
      },
      {
        code: '027',
        name: 'Музеєзнавство, пам’яткознавство',
      },
      {
        code: '028',
        name: 'Менеджмент соціокультурної діяльності',
      },
      {
        code: '029',
        name: 'Інформаційна, бібліотечна та архівна справа',
      },
    ],
  },
  {
    code: '03',
    name: 'Гуманітарні науки',
    specialties: [
      {
        code: '031',
        name: 'Релігієзнавство',
      },
      {
        code: '032',
        name: 'Історія та археологія',
      },
      {
        code: '033',
        name: 'Філософія',
      },
      {
        code: '034',
        name: 'Культурологія',
      },
      {
        code: '035',
        name: 'Філологія',
      },
    ],
  },
  {
    code: '04',
    name: 'Богослов’я',
    specialties: [
      {
        code: '041',
        name: 'Богослов’я',
      },
    ],
  },
  {
    code: '05',
    name: 'Соціальні та поведінкові науки',
    specialties: [
      {
        code: '051',
        name: 'Економіка',
      },
      {
        code: '052',
        name: 'Політологія',
      },
      {
        code: '053',
        name: 'Психологія',
      },
      {
        code: '054',
        name: 'Соціологія',
      },
      {
        code: '055',
        name: 'Міжнародні відносини, суспільні комунікації та регіональні студії',
      },
      {
        code: '056',
        name: 'Міжнародні економічні відносини',
      },
    ],
  },
  {
    code: '06',
    name: 'Журналістика',
    specialties: [
      {
        code: '061',
        name: 'Журналістика',
      },
    ],
  },
  {
    code: '07',
    name: 'Управління та адміністрування',
    specialties: [
      {
        code: '071',
        name: 'Облік і оподаткування',
      },
      {
        code: '072',
        name: 'Фінанси, банківська справа та страхування',
      },
      {
        code: '073',
        name: 'Менеджмент',
      },
      {
        code: '074',
        name: 'Публічне управління та адміністрування',
      },
      {
        code: '075',
        name: 'Маркетинг',
      },
      {
        code: '076',
        name: 'Підприємництво, торгівля та біржова діяльність',
      },
    ],
  },
  {
    code: '08',
    name: 'Право',
    specialties: [
      {
        code: '081',
        name: 'Право',
      },
      {
        code: '082',
        name: 'Міжнародне право',
      },
    ],
  },
  {
    code: '09',
    name: 'Біологія',
    specialties: [
      {
        code: '091',
        name: 'Біологія',
      },
    ],
  },
  {
    code: '10',
    name: 'Природничі науки',
    specialties: [
      {
        code: '101',
        name: 'Екологія',
      },
      {
        code: '102',
        name: 'Хімія',
      },
      {
        code: '103',
        name: 'Науки про Землю',
      },
      {
        code: '104',
        name: 'Фізика та астрономія',
      },
      {
        code: '105',
        name: 'Прикладна фізика та наноматеріали',
      },
    ],
  },
  {
    code: '11',
    name: 'Математика та статистика',
    specialties: [
      {
        code: '111',
        name: 'Математика',
      },
      {
        code: '112',
        name: 'Статистика',
      },
      {
        code: '113',
        name: 'Прикладна математика',
      },
    ],
  },
  {
    code: '12',
    name: 'Інформаційні технології',
    specialties: [
      {
        code: '121',
        name: 'Інженерія програмного забезпечення',
      },
      {
        code: '122',
        name: 'Комп’ютерні науки та інформаційні технології',
      },
      {
        code: '123',
        name: 'Комп’ютерна інженерія',
      },
      {
        code: '124',
        name: 'Системний аналіз',
      },
      {
        code: '125',
        name: 'Кібербезпека',
      },
    ],
  },
  {
    code: '13',
    name: 'Механічна інженерія',
    specialties: [
      {
        code: '131',
        name: 'Прикладна механіка',
      },
      {
        code: '132',
        name: 'Матеріалознавство',
      },
      {
        code: '133',
        name: 'Галузеве машинобудування',
      },
      {
        code: '134',
        name: 'Авіаційна та ракетно-космічна техніка',
      },
      {
        code: '135',
        name: 'Суднобудування',
      },
      {
        code: '136',
        name: 'Металургія',
      },
    ],
  },
  {
    code: '14',
    name: 'Електрична інженерія',
    specialties: [
      {
        code: '141',
        name: 'Електроенергетика, електротехніка та електромеханіка',
      },
      {
        code: '142',
        name: 'Енергетичне машинобудування',
      },
      {
        code: '143',
        name: 'Атомна енергетика',
      },
      {
        code: '144',
        name: 'Теплоенергетика',
      },
      {
        code: '145',
        name: 'Гідроенергетика',
      },
    ],
  },
  {
    code: '15',
    name: 'Автоматизація та приладобудування',
    specialties: [
      {
        code: '151',
        name: 'Автоматизація та комп’ютерно-інтегровані технології',
      },
      {
        code: '152',
        name: 'Метрологія та інформаційно-вимірювальна техніка',
      },
      {
        code: '153',
        name: 'Мікро- та наносистемна техніка',
      },
    ],
  },
  {
    code: '16',
    name: 'Хімічна та біоінженерія',
    specialties: [
      {
        code: '161',
        name: 'Хімічні технології та інженерія',
      },
      {
        code: '162',
        name: 'Біотехнології та біоінженерія',
      },
      {
        code: '163',
        name: 'Біомедична інженерія',
      },
    ],
  },
  {
    code: '17',
    name: 'Електроніка та телекомунікації',
    specialties: [
      {
        code: '171',
        name: 'Електроніка',
      },
      {
        code: '172',
        name: 'Телекомунікації та радіотехніка',
      },
      {
        code: '173',
        name: 'Авіоніка',
      },
    ],
  },
  {
    code: '18',
    name: 'Виробництво та технології',
    specialties: [
      {
        code: '181',
        name: 'Харчові технології',
      },
      {
        code: '182',
        name: 'Технології легкої промисловості',
      },
      {
        code: '183',
        name: 'Технології захисту навколишнього середовища',
      },
      {
        code: '184',
        name: 'Гірництво',
      },
      {
        code: '185',
        name: 'Нафтогазова інженерія та технології',
      },
      {
        code: '186',
        name: 'Видавництво та поліграфія',
      },
    ],
  },
  {
    code: '19',
    name: 'Архітектура та будівництво',
    specialties: [
      {
        code: '191',
        name: 'Архітектура та містобудування',
      },
      {
        code: '192',
        name: 'Будівництво та цивільна інженерія',
      },
      {
        code: '193',
        name: 'Геодезія та землеустрій',
      },
    ],
  },
  {
    code: '20',
    name: 'Аграрні науки та продовольство',
    specialties: [
      {
        code: '201',
        name: 'Агрономія',
      },
      {
        code: '202',
        name: 'Захист і карантин рослин',
      },
      {
        code: '203',
        name: 'Садівництво та виноградарство',
      },
      {
        code: '204',
        name: 'Технологія виробництва і переробки продукції тваринництва',
      },
      {
        code: '205',
        name: 'Лісове господарство',
      },
      {
        code: '206',
        name: 'Садово-паркове господарство',
      },
      {
        code: '207',
        name: 'Водні біоресурси та аквакультура',
      },
      {
        code: '208',
        name: 'Агроінженерія',
      },
    ],
  },
  {
    code: '21',
    name: 'Ветеринарна медицина',
    specialties: [
      {
        code: '211',
        name: 'Ветеринарна медицина',
      },
      {
        code: '212',
        name: 'Ветеринарна гігієна, санітарія і експертиза',
      },
    ],
  },
  {
    code: '22',
    name: 'Охорона здоров’я',
    specialties: [
      {
        code: '221',
        name: 'Стоматологія',
      },
      {
        code: '222',
        name: 'Медицина',
      },
      {
        code: '223',
        name: 'Медсестринство',
      },
      {
        code: '224',
        name: 'Технології медичної діагностики та лікування',
      },
      {
        code: '225',
        name: 'Медична та психологічна реабілітація',
      },
      {
        code: '226',
        name: 'Фармація',
      },
      {
        code: '227',
        name: 'Фізична реабілітація',
      },
    ],
  },
  {
    code: '23',
    name: 'Соціальна робота',
    specialties: [
      {
        code: '231',
        name: 'Соціальна робота',
      },
      {
        code: '232',
        name: 'Соціальне забезпечення',
      },
    ],
  },
  {
    code: '24',
    name: 'Сфера обслуговування',
    specialties: [
      {
        code: '241',
        name: 'Готельно-ресторанна справа',
      },
      {
        code: '242',
        name: 'Туризм',
      },
    ],
  },
  {
    code: '25',
    name: 'Воєнні науки, національна безпека, безпека державного кордону',
    specialties: [
      {
        code: '251',
        name: 'Державна безпека',
      },
      {
        code: '252',
        name: 'Безпека державного кордону',
      },
      {
        code: '253',
        name: 'Військове управління (за видами збройних сил)',
      },
      {
        code: '254',
        name: 'Забезпечення військ (сил)',
      },
      {
        code: '255',
        name: 'Озброєння та військова техніка',
      },
    ],
  },
  {
    code: '26',
    name: 'Цивільна безпека',
    specialties: [
      {
        code: '261',
        name: 'Пожежна безпека',
      },
      {
        code: '262',
        name: 'Правоохоронна діяльність',
      },
      {
        code: '263',
        name: 'Цивільна безпека',
      },
    ],
  },
  {
    code: '27',
    name: 'Транспорт',
    specialties: [
      {
        code: '271',
        name: 'Річковий та морський транспорт',
      },
      {
        code: '272',
        name: 'Авіаційний транспорт',
      },
      {
        code: '273',
        name: 'Залізничний транспорт',
      },
      {
        code: '274',
        name: 'Автомобільний транспорт',
      },
      {
        code: '275',
        name: 'Транспортні технології (за видами)',
      },
    ],
  },
];

export const specialtiesItems = specialities.reduce((acc: any, item) => {
  const specialties = item.specialties.map(specialty => ({
    label: `${specialty.name} (${specialty.code})`,
    value: specialty.code,
  }));
  return [...acc, ...specialties];
}, []);

export const getSpecialityName = (code: string) => {
  const specialty = specialtiesItems.find((s: any) => s.value === code);
  return specialty ? specialty.label : '';
};
